teste/respostas.md

# Table of Contents

1.  [Qualidade de código](#org6d15d9d)
    1.  [Primeiro e necessário entender o motivo de se implementar a funcionalidade](#orgafac509)
    2.  [Durante todo o processo de desenvolvimento](#org5ee57f3)



<a id="org6d15d9d"></a>

# Qualidade de código


<a id="orgafac509"></a>

## Primeiro e necessário entender o motivo de se implementar a funcionalidade

apos ter certeza que entendi o problema,escrevo o código e vou refatorando ate ter um código que eu seja capaz de entender olhando as funções e seus retornos.Avalio se tenho um bom modelo para representar o problema que preciso resolver.Se esse modelo for capaz de expressar e lidar com todas as partes do problema tudo esta ok e faco testes manuais na aplicação,quando o modelo não e capaz de representar todo o problema tento ver oque faltou eu representar ou se foi algo que entendi errado.


<a id="org5ee57f3"></a>

## Durante todo o processo de desenvolvimento

para se ter um código de qualidade e necessário entender bem o problema,oque vem antes de se escrever qualquer linha de código,mas e necessário sempre conferir o código apos escrito,pois mesmo caso tenhamos escrito um código que represente o problema e seja claro de ler,se a logica for falha haverá bugs,ou problemas de performance,então e necessário se preocupar com a qualidade antes de se escrever o código,para que não se tente resolver e implementar as coisas erradas,mas durante e apos se escrever o código e sempre necessário averiguar oque foi feito e se não ha outras alternativas.

